{
  "title": "PRD Redesign: About Us Page (DoktorABC)",
  "confluence_id": "1968046092",
  "created": "2025-10-29",
  "status": "Design Requirements",
  "context": {
    "description": "The 'About Us' page is the main brand credibility touchpoint for new and returning customers. It must communicate who we are, our mission and vision, and the trustworthiness of DoktorABC's medical and operational infrastructure.",
    "visitors": [
      "New users evaluating DoktorABC for the first time",
      "Returning customers seeking reassurance about our legitimacy",
      "Users clicking through from the footer, FAQ, or press coverage"
    ],
    "design_principle": "The design must emphasize transparency, professionalism, and credibility — clearly showing that DoktorABC is a medically regulated, trusted, and responsible healthcare provider operating in Europe"
  },
  "personas": {
    "new_visitors": {
      "description": "Arrive from Google or marketing campaigns; want to verify DoktorABC's legitimacy and understand who is behind the service",
      "goal": "Build trust, understand the company's mission, and feel safe to purchase or start consultation"
    },
    "returning_customers": {
      "description": "Existing patients who want to confirm the credibility of our doctors and operations",
      "goal": "Learn more about our regulatory framework, physicians, and global presence"
    },
    "press_partners": {
      "description": "Journalists or potential business partners checking the brand's credibility and scale",
      "goal": "Quickly identify the company's scope, certifications, and media mentions"
    }
  },
  "success_indicators": {
    "time_on_page": "≥ 1 minute (indicates engagement and trust reading)",
    "click_through_rate": "5-8% (to consultation or treatments)",
    "scroll_depth": "≥ 75% (users reach the medical & certifications sections)"
  },
  "design_sections": [
    {
      "section": "Navbar",
      "requirements": [
        "Standard DoktorABC header with: Company logo, Cart, My Account, Hamburger menu"
      ],
      "notes": "Same as across main site. Sticky at top"
    },
    {
      "section": "Hero Section – 'Who We Are'",
      "requirements": [
        "Title: 'Who We Are'",
        "Text: 'DoktorABC is a trusted European telemedicine platform that connects patients, licensed physicians, and partner pharmacies to provide online consultations, prescriptions, and medicine delivery across Europe.'",
        "Visual: Image of a doctor with patient, or pharmacy team"
      ],
      "notes": "First fold must establish brand identity, professionalism, and tone of trust"
    },
    {
      "section": "Our Mission Section",
      "requirements": [
        "Title: 'Our Mission'",
        "Text: 'Our mission is to make healthcare accessible, affordable, and convenient via a fully digital platform that connects patients, licensed physicians, and pharmacies across Europe. We combine technology and clinical expertise to deliver healthcare conveniently, discreetly, and at scale.'",
        "Graphic: Process line or small icons showing flow — Consult → Diagnosis → Prescription → Dispensing"
      ],
      "notes": "Design should mirror the slide visual with a clean, medical layout"
    },
    {
      "section": "Our Vision Section",
      "requirements": [
        "Title: 'Our Vision'",
        "Text: 'To redefine the way people access healthcare — making high-quality medical treatment seamless, private, and personalized for everyone.'"
      ],
      "notes": "Place after Mission for logical flow. Minimal visual needed"
    },
    {
      "section": "Where We Operate Section",
      "requirements": [
        "Title: 'Where We Operate'",
        "Text: 'DoktorABC operates across Europe through licensed partners and physicians in Germany, France, and Switzerland, managed by Sky Marketing LTD in the UK and HelFy LTD in Israel.'",
        "Map Visualization: Interactive or static map with flag regions"
      ],
      "notes": "Use green brand markers on map (like presentation slide)"
    },
    {
      "section": "Our Numbers (Growth & Scale)",
      "requirements": [
        "Title: 'How We Grow'",
        "4 Data Blocks: '1M+ Customers Served', '40+ Types of Treatments', '50+ Partner Pharmacies', '100+ Employees', '7 years of trust'",
        "Include Trustpilot rating (4.6 ★ from 13,000+ reviews) and Käuferschutz badge"
      ],
      "notes": "Should visually match presentation 'How we grow' slide"
    },
    {
      "section": "Our Doctors Section",
      "requirements": [
        "Title: 'Meet Our Doctors'",
        "Doctor Card Template (for each doctor): Doctor's photo, Full name and title, Country / Practice location, Short bio or specialization line",
        "Regulatory authority: e.g., 'Entidade Reguladora da Saúde, Rua S. João de Brito, 621 L32, 4100-455 Porto, Portugal.'",
        "Link text: 'Check the registration of the treating physicians here.'"
      ],
      "notes": "Display 3-4 doctor cards per row, scrollable on mobile"
    },
    {
      "section": "Customer Reviews Section",
      "requirements": [
        "Title: 'What Our Patients Say'",
        "Content: Carousel or grid of 4-6 verified Trustpilot reviews with rating stars and review snippet",
        "Include average rating (e.g., 4.6 / 5)"
      ],
      "notes": "Consistency with homepage Trustpilot integration"
    },
    {
      "section": "Press Mentions Section",
      "requirements": [
        "Title: 'As Seen In' or 'Our Press'",
        "Logos carousel of media outlets that have featured DoktorABC",
        "Logos: Yahoo Finance, Tagesspiegel, Nordbayern.de, OK! Magazin, Vital"
      ],
      "notes": "Same press logo order and styling as homepage"
    },
    {
      "section": "Certifications & Compliance Section",
      "requirements": [
        "Title: 'Our Certifications'",
        "Include logos and short descriptions: LegitScript – certified for healthcare compliance, PCI Security Standards Council – secure coordination of data handling, DMCA Protected – content and brand protection, BIM Membership – ensuring regulatory and ethical compliance",
        "Each certification includes 1-line description from the presentation"
      ],
      "notes": "Display horizontally in logo row with small text below each"
    },
    {
      "section": "Payment & Privacy Section",
      "requirements": [
        "Title: 'Your Privacy & Payment Security'",
        "Icons for accepted payment methods (PayPal, Visa, Mastercard, Klarna)",
        "Include DoktorABC Data Privacy logo (GDPR compliance)"
      ],
      "notes": "Compact visual design — trust-focused close to footer"
    },
    {
      "section": "Final CTA Section",
      "requirements": [
        "Title: 'Start Your Treatment Today'",
        "Button: 'View All Treatments' or 'Start Consultation'"
      ],
      "notes": "Optional closing CTA to lead back to main conversion funnel"
    },
    {
      "section": "Footer",
      "requirements": [
        "Standard DoktorABC footer with: Logo, Navigation links (About, Treatments, FAQ, Contact), Payment methods, Country flags, Company address & certifications, © 2025 DoktorABC.com, Disclaimer text"
      ],
      "notes": "Must match global site structure and styling"
    }
  ],
  "source": "Confluence Page ID 1968046092"
}
