{
  "title": "PRD ReDesign: Error Pages (404 / 500 / 502)",
  "confluence_id": "1960574989",
  "created": "2025-10-22",
  "status": "Design Requirements",
  "context": {
    "description": "Error pages are part of the user experience, not just a technical fallback. When users hit a broken or unavailable page, they experience frustration, uncertainty, and sometimes distrust. Our responsibility is to turn that negative moment into a reassuring, helpful, and brand-consistent experience.",
    "design_principle": "These pages are visible to all user types, across web and mobile, and therefore must follow the same tone, branding, and visual system as the main site: calm, professional, and trustworthy, not overly playful or alarming"
  },
  "personas": {
    "new_visitors": {
      "description": "Users arriving from organic search, ads, or backlinks (external campaigns). They may be exploring DoktorABC for the first time."
    },
    "returning_customers": {
      "description": "Users who have purchased or consulted before. They might be revisiting bookmarked links or older URLs."
    },
    "high_intent_users": {
      "description": "Users who were completing a form, consultation, or payment when an error occurred."
    },
    "support_seekers": {
      "description": "Users seeking information about delivery, accounts, or prescriptions."
    }
  },
  "error_pages": [
    {
      "type": "404 - Page Not Found",
      "context": "This page appears when a user follows a broken link, mistypes a URL, or accesses a page that no longer exists. These users are 'lost', our job is to guide them back with clarity and empathy.",
      "content": {
        "headline": "'Page Not Found' or 'We can't seem to find that page.'",
        "body_copy": "'Sorry, the page you're looking for doesn't exist or may have been moved.'",
        "image": "A clean, on-brand graphic, e.g a stylized, empty"
      },
      "buttons_and_actions": {
        "primary_button": "'Go to Homepage' - main recovery route",
        "helpful_links": [
          "'How It Works'",
          "'Contact Support' / 'Help Center'"
        ]
      }
    },
    {
      "type": "500 / 502 - Server Error",
      "context": "This occurs when DoktorABC experiences a temporary backend failure or technical issue (internal server error, bad gateway). The user did nothing wrong, our responsibility is to reassure them and guide them safely.",
      "content": {
        "headline": "'Something went wrong on our end.'",
        "body_copy": "'We're sorry, but we're experiencing a temporary technical issue. Our team has been automatically notified and is working to fix it. Please try refreshing the page in a few moments.'",
        "image": "A calm and supportive image"
      },
      "buttons_and_actions": {
        "primary_button": "'Refresh This Page' - since 500 errors are often temporary, this is the main action",
        "secondary_button": "'Go to Homepage' - backup route if refresh doesn't resolve it",
        "key_link": "'Contact Support' - critical for users in checkout or consultation"
      }
    }
  ],
  "figma_links": [
    "https://www.figma.com/design/IhA4sJGAztWKehQ9hFqRfK/UI-UX-Redesign?node-id=9723-84592&p=f&t=F5at0F3hLYIB0bIH-11"
  ],
  "spreadsheet_link": "https://docs.google.com/spreadsheets/d/1UeeDy-yEtzmrdropRaNAEPH7ChdnfaeALiIHIGiN6WQ/edit?gid=433031967#gid=433031967",
  "source": "Confluence Page ID 1960574989"
}
