{
  "title": "PRD ReDesign: Shipping Page",
  "confluence_id": "1956053007",
  "created": "2025-10-18",
  "status": "Design Requirements",
  "background": {
    "description": "The Shipping Page is a key informational page designed to provide users with clear, transparent details about DoktorABC's delivery methods, timelines, packaging, and policies.",
    "user_types": [
      "Pre-order users: researching delivery options before making a purchase",
      "Post-order users: looking for details about their shipment, expected delivery times, or carrier information"
    ],
    "traffic_source": "Most traffic comes via the footer or the tab in the navbar (CMS pages)",
    "goal": "Improve transparency, trust, and conversion by clearly presenting all shipping options and reinforcing DoktorABC's professionalism and discretion"
  },
  "data_last_30_days": {
    "conversion_rate_24h": "18.15% (page view → paid order within 24h)",
    "conversion_rate_1h": "13.63% (page view → paid order within 1h)",
    "unique_users": "5,869",
    "total_page_views": "8,415"
  },
  "target_audience": [
    "Users navigate from the nav bar, footer, or menu tab to learn about delivery",
    "Users with questions or concerns about shipping before or after purchase",
    "Users who encountered delivery-related issues or want to verify providers, timelines, or packaging discretion"
  ],
  "page_purpose": "To give users a complete, transparent, and trustworthy overview of DoktorABC's shipping methods including: Delivery types and timelines, Availability and restrictions, Privacy and packaging standards, Contact guidance for support",
  "success_indicators": [
    "Increase conversion rate from users who view the shipping page → paid order",
    "Reduce % of customer service tickets related to pre-order shipping questions"
  ],
  "design_sections": [
    {
      "section": "Navbar",
      "requirements": [
        "Standard DoktorABC navbar"
      ],
      "notes": "Same structure as homepage and category pages"
    },
    {
      "section": "Hero Section",
      "requirements": [
        "Title: 'Fast. Discreet. Reliable: Your shipping with DoktorABC'",
        "Subtitle: 'We deliver your medicine as quickly as possible - in neutral packaging, with the utmost privacy and complete confidence. Your health deserves nothing less.'",
        "Must include a relevant hero image (delivery or neutral packaging theme)",
        "Include the following USPs: > 90% of all orders are shipped within 24 hours, Express delivery in 2 hours is available in selected locations, Neutral packaging with no externally visible indication of the contents, Free delivery with all options (where applicable), Shipment tracking included - stay informed at all times, Delivery on working days (Monday - Friday)"
      ],
      "notes": "The hero section must be visually clear, premium, and trustworthy. It should reflect discretion, speed, and professionalism"
    },
    {
      "section": "Our Shipping Options Section",
      "requirements": [
        "Main title: 'Your shipping methods at a glance'",
        "Subtitle: 'Choose the shipping option that best suits your needs, depending on urgency, location, or pickup preference. All options are secure, discreet, and professionally organized.'",
        "Three Option Cards: a) 2-hour express delivery (Uber/courier), b) DHL - 24-48h delivery, c) Pickup - Pick up at the pharmacy"
      ],
      "notes": "Each shipping option must be presented as an individual card with clear icons and visual differentiation. The section should appear structured, easy to scan, and mobile-friendly"
    },
    {
      "section": "Neutral Packaging - Discreet & Secure Section",
      "requirements": [
        "Heading: 'Our neutral packaging: Why, how, what?'",
        "Paragraph explaining privacy priority",
        "Sub-heading: 'What does 'neutral packaging' mean?'",
        "Bullet points: No logos or references to medical contents on the outside, Outer shell looks like any standard shipping box, Inside you will find your medication carefully packaged, Packaging is designed to avoid insights, Discreet shipping notification",
        "Sub-heading: 'Why do we do this?'",
        "Paragraph explaining discretion importance"
      ],
      "notes": "Design should visually emphasize discretion. Use muted colors, clean layout, and iconography of packaging and privacy"
    },
    {
      "section": "How It Works - Step by Step Section",
      "requirements": [
        "Heading: 'How your shipping works with DoktorABC'",
        "Numbered steps: 1) Online questionnaire & consultation, 2) Prescription issuance, 3) Choose shipping option, 4) Discreet delivery or pickup, 5) Acceptance & Use"
      ],
      "notes": "Present steps in a horizontal timeline or numbered column layout with icons for each step"
    },
    {
      "section": "FAQ Section",
      "requirements": [
        "Heading: 'Frequently asked questions about shipping'",
        "6 FAQs covering: 2-hour delivery regions, Free shipping, Tracking, Not home scenarios, Privacy guarantee, Pickup options"
      ],
      "notes": "FAQs should appear in collapsible accordion format with icons for each question. Maintain consistent FAQ design as homepage"
    },
    {
      "section": "Final Call to Action Section",
      "requirements": [
        "Heading: 'Ready for your treatment?'",
        "Paragraph encouraging consultation start",
        "Button: 'Start consultation now'",
        "Category navigation buttons (same as on homepage)"
      ],
      "notes": "CTA must be strong and visible, styled like homepage buttons"
    },
    {
      "section": "Payment method",
      "requirements": [
        "Add our payment method logo strip"
      ]
    },
    {
      "section": "Legal & Notes Section",
      "requirements": [
        "Small print paragraph: Note about shipping commencement, delivery on weekends/public holidays, availability of 2-hour delivery"
      ],
      "notes": "Must appear at bottom of the page before footer. Simple, readable text format"
    }
  ],
  "source": "Confluence Page ID 1956053007"
}
